Revit 2024 API
BuiltInFailures.AutoJoinFailures.DesignOptionCannotReference Property
 Design Option ' [Name] ' cannot reference Design Option ' [Name] '.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DesignOptionCannotReference { get; }
Visual Basic
Public Shared ReadOnly Property DesignOptionCannotReference As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DesignOptionCannotReference {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace